# Your pandas question answered

video: https://www.youtube.com/watch?v=B-r9VuK80dk&index=10&list=PL5-da3qGB5ICCsgW1MxlZ0Hq8LL5U3u9y

### 1\. What about reading from a csv file and reading only two columns and ignoring the others?

In [1]:
import pandas as pd

In [4]:
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.columns

In [5]:
ufo = pd.read_csv('http://bit.ly/uforeports', usecols = ['City','State'])
ufo.columns

Index(['City', 'State'], dtype='object')

In [6]:
ufo = pd.read_csv('http://bit.ly/uforeports', usecols = [0,4])
ufo.columns

Index(['City', 'Time'], dtype='object')

### 2\. What is a way to speed up the reading of a CSV file?

In [7]:
ufo = pd.read_csv('http://bit.ly/uforeports', nrows = 3)

### 3\. How do Dataframes and Series work with regard to selecting indicidual entries an itereation (for X in userdata)?

In [8]:
for c in ufo.City:
    print(c)

Ithaca
Willingboro
Holyoke

In [9]:
for index

          City  Colors Reported Shape Reported State             Time
0       Ithaca              NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro              NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke              NaN           OVAL    CO  2/15/1931 14:00

In [10]:
for index, row in ufo.iterrows():
    print(index, row.City, row.State)

0 Ithaca NY
1 Willingboro NJ
2 Holyoke CO

### 4. What is best way to drop all none numeric column from the dataframe?

In [11]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [12]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [15]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [16]:
import numpy as np

In [17]:
drinks.select_dtypes(include = [np.number]).dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

### 5. when to use parentheses and when to use brakets?

In [20]:
drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [19]:
# Looking at the help function "shift" + "tab"
# we will see that by default includs only the numeric columns
# if we want to include all columns then we need to add "describe(include = 'all')"
drinks.describe(include = 'all')

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
count,193,193.000000,193.000000,193.000000,193.000000,193
unique,193,NaN,NaN,NaN,NaN,6
top,Kiribati,NaN,NaN,NaN,NaN,Africa
freq,1,NaN,NaN,NaN,NaN,53
mean,NaN,106.160622,80.994819,49.450777,4.717098,NaN
std,NaN,101.143103,88.284312,79.697598,3.773298,NaN
min,NaN,0.000000,0.000000,0.000000,0.000000,NaN
25%,NaN,20.000000,4.000000,1.000000,1.300000,NaN
50%,NaN,76.000000,56.000000,8.000000,4.200000,NaN
75%,NaN,188.000000,128.000000,59.000000,7.200000,NaN
max,NaN,376.000000,438.000000,370.000000,14.400000,NaN

In [21]:
# if you add "describe(include = ['object', 'float64'])" the it will only add the objects that are in the list
# in this case the list is ['object', 'float64']. This is why we need a braket, because it is a list
drinks.describe(include = ['object', 'float64'])

         country  total_litres_of_pure_alcohol continent
count        193                    193.000000       193
unique       193                           NaN         6
top     Kiribati                           NaN    Africa
freq           1                           NaN        53
mean         NaN                      4.717098       NaN
std          NaN                      3.773298       NaN
min          NaN                      0.000000       NaN
25%          NaN                      1.300000       NaN
50%          NaN                      4.200000       NaN
75%          NaN                      7.200000       NaN
max          NaN                     14.400000       NaN